{
  "hasNext": true,
  "testimonials": [
    {
      "id": "42",
      "message": "AlgoExpert was my go-to course to ace those coding interviews. I really liked the depth of explanation in the video tutorials and the user-friendly interface. I guess AlgoExpert and a lot of hard work makes everything possible (journey from pre-sales to development)!"
    },
    {
      "id": "43",
      "message": "I would just like to point out that AlgoExpert helped me a lot to get an offer from Amazon - UK office (I accepted it). I think that AlgoExpert has everything you need in one place. It covers all important topics. I especially like the possibility to see hints in order to get an idea for the solution or to check the whole video explanation if necessary (which is very well explained!). You can literally prepare the whole coding part of the interview without changing the web browser tab."
    },
    {
      "id": "44",
      "message": "After reading a book on algorithms and data structures, I purchased AlgoExpert to prepare for interviews. Guys, seriously, this is an amazing product! I went through the questions at least 5 times before my interview. Now I am working at Google as a SWE. I honestly couldn't have gotten the offer without this product."
    },
    {
      "id": "45",
      "message": "AlgoExpert was instrumental to me getting the job at Microsoft. I was going through different sites and applications to help in my study of algorithms and data structures, but nothing was as thorough and clear as AlgoExpert. I am now starting as a Site Reliability Engineer II at Microsoft, thanks to this site!"
    },
    {
      "id": "46",
      "message": "AlgoExpert helped me build a very solid foundation to tackle most of the common problems you can encounter during the interview. The most valuable feature, by far, is the video walkthroughs for each problem which makes you understand how to approach the problem. If you want to build/improve your toolset for solving problems, AlgoExpert is worth every penny. Well done."
    },
    {
      "id": "47",
      "message": "There are many platforms I tried out, but nothing taught me the problem solving skillset. They just directly jump into the solution without the why and the how. AlgoExpert has helped me transition from a service based company to a FANG company. Loads of love for the platform and of course to Clement as well."
    },
    {
      "id": "48",
      "message": "When I got the opportunity to interview at Google, I wasn't sure my skills were up to the task. The problems here really helped me brush up on some topics I hadn't covered for a long time during my time in the industry, and really gave me the confidence to go into my interviews knowing that I'd be able to give them my best. Thanks to AlgoExpert, I was able to get an offer with a significant salary increase from my last position!"
    },
    {
      "id": "49",
      "message": "AlgoExpert provides highly tailored problems and explanations that have definitely improved my problem solving abilities. It has given me the insight on how to think efficiently during an interview and how to tackle new and challenging problems."
    },
    {
      "id": "50",
      "message": "I used AlgoExpert to prepare for my coding interviews, and even though I was no where close to finishing all the problems, I had gained so much knowledge from the little that I did learn. With that alone it gave me more confidence to go into my interviews, and be able to problem solve on the spot without memorization, and now I'm doing great work at IBM working on a product that gets used by hundreds of millions daily. AlgoExpert is great for learning how to approach and solve problems, not just to memorize solutions. Thanks to all that work on this product."
    },
    {
      "id": "51",
      "message": "Thank you AlgoExpert team! After using the product I was able to perform well with confidence at multiple FANG on-sites and secure an offer at a hot startup. No joke, every question I got was a variation of something on the platform. Both Algo and System Design Expert gave me the tools needed to ace the interviews! Also, a shoutout to the behavior section. Super helpful, especially when applying to a smaller company where culture fit is so important. The AlgoExpert platform will be my go to for all future interviews. Cheers!"
    },
    {
      "id": "52",
      "message": "Thanks a lot to Algo/Systems Expert for the honest and well-tailored content, I could land a job at my dream company (Google). Your platform helped me to gain confidence and believe in myself. There are an overwhelming amount of resources for interview preparation out there but I would say sys/algo expert is the best among them!!"
    },
    {
      "id": "53",
      "message": "I used AlgoExpert and SystemsExpert to prepare for my coding interviews and I got successfully an offer from the company I work today in San Francisco. I'm so satisfied about how clean and simple these products are built! Will definitely keep answering code questions to keep me in shape in the future!"
    },
    {
      "id": "54",
      "message": "I used AlgoExpert to prepare for my coding + system design interviews at Facebook and Amazon and I got an offer from both companies! Ended up taking the L5 offer from Facebook. The material presented in AlgoExpert and especially SystemsExpert was incredibly useful and very pertinent to the interview rounds that I experienced. Highly recommended!"
    },
    {
      "id": "55",
      "message": "I was using AlgoExpert in my toolkit for interview prep to refresh myself after a few years of full-time motherhood. The curated problem selection and thoughtful problem design in AlgoExpert allowed me to rekindle the problem solving intuition for top-tier tech interviewing very quickly. Thank you for providing this service at an affordable price!"
    },
    {
      "id": "56",
      "message": "I initially purchased both AlgoExpert and SystemsExpert just to get some mock practice ahead of technical interviews. To my pleasant surprise, its content was so holistic that I can confidently say that this platform was the bedrock of my coding and system design interview preparation. \n\nThe solutions on AlgoExpert are not only in depth but cultivate a natural sense of optimizing an often simple (naïve) brute force approach to an optimal one. This is very close to expectations in an actual coding interview. In addition, the course on systems expert is very well structured. I have yet to find a more consolidated platform that not only gives you a breadth of coverage in distributed systems but also walks you through some actual system design question in an interactive manner. \n\nThe real cherry on the top was that some of my phone screens were waived because the recruiters were aware of AlgoExpert assessments/profile :) It literally helped me get fast tracked straight to the on-sites at some of the top companies and expedited the interview process.\n\nA few months ago, I wouldn't have thought about acing my technical interviews at top companies, let alone landing offers from most of them. I just received an offer from Google and I can gladly say that AlgoExpert played a massive part in accomplishing this endeavor. Best investment I ever made. "
    }
  ]
}